import requests
import json

class ClaudeClient:
    def __init__(self, host='127.0.0.1', port=8088):
        self.url = f'http://{host}:{port}'

    def stream_chat(self, prompt):
        data = {'prompt': prompt}
        response = requests.post(self.url + '/claude/stream_chat', json=data)
        return response

    def reset(self):
        requests.post(self.url + '/claude/reset')

    def chat(self, prompt):
        data = {'prompt': prompt}
        response = requests.post(self.url + '/claude/chat', json=data)
        return response.text


if __name__ == '__main__':
    client = ClaudeClient()
    str='''
    
    Stkcd ShortName PersonID Year Name Gender Age OveseaBack OveseaBack1 OveseaBack2 OveseaBack3 OveseaBack4 LHR DNumber IDNumber Indcd TotalAsset liquidasset liquidliabilities Retainedearningsassetratio totalliabilities Interestexpense Netprofit Totalmarketcapitalization zhejiutanxiao Interest NewInterest X1 X2 X3 X4 X5 F
2 万科A 30177788 2018 康典 男 71 4 0 0 0 1 0.2938 11 4 3 1,529,000,000,000.00  1,295,000,000,000.00  1,122,000,000,000.00  0.09  1,293,000,000,000.00  8,181,000,000.00  49,270,000,000.00  231,600,000,000.00  2,922,000,000.00  8,181,000,000.00  14,150,000,000.00  0.11328029 0.091011 0.04036806 0.17914754 0.0433998 0.062747936
2 万科A 30373837 2018 吴嘉宁 男 59 4 0 0 0 1 0.2938 11 4 3 1,529,000,000,000.00  1,295,000,000,000.00  1,122,000,000,000.00  0.09  1,293,000,000,000.00  8,181,000,000.00  49,270,000,000.00  231,600,000,000.00  2,922,000,000.00  8,181,000,000.00  14,150,000,000.00  0.11328029 0.091011 0.04036806 0.17914754 0.0433998 0.062747936
2 万科A 30373839 2018 李强 男 47 4 0 0 0 1 0.2938 11 4 3 1,529,000,000,000.00  1,295,000,000,000.00  1,122,000,000,000.00  0.09  1,293,000,000,000.00  8,181,000,000.00  49,270,000,000.00  231,600,000,000.00  2,922,000,000.00  8,181,000,000.00  14,150,000,000.00  0.11328029 0.091011 0.04036806 0.17914754 0.0433998 0.062747936
2 万科A 30373838 2018 刘姝威 女 67 4 0 0 0 1 0.2938 11 4 3 1,529,000,000,000.00  1,295,000,000,000.00  1,122,000,000,000.00  0.09  1,293,000,000,000.00  8,181,000,000.00  49,270,000,000.00  231,600,000,000.00  2,922,000,000.00  8,181,000,000.00  14,150,000,000.00  0.11328029 0.091011 0.04036806 0.17914754 0.0433998 0.062747936
2 万科A 30373838 2019 吴嘉宁 男 60 4 0 0 0 1 0.2869 10 4 3 1,730,000,000,000.00  1,439,000,000,000.00  1,273,000,000,000.00  0.10  1,459,000,000,000.00  9,255,000,000.00  55,130,000,000.00  312,900,000,000.00  4,120,000,000.00  9,255,000,000.00  14,950,000,000.00  0.0961768 0.096061 0.04060103 0.21442736 0.04289204 0.045583333
2 万科A 30373837 2019 李强 男 48 4 0 0 0 1 0.2869 10 4 3 1,730,000,000,000.00  1,439,000,000,000.00  1,273,000,00


这是一个excel的前5行，帮我写一份python代码，读取这个excel，然后每一个ShortName，每个Year，有多少个name。
    
    '''
    print(client.chat(str))
